# Network_NodePropertyNotSet Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MEPCalculationFailures..::..Network_NodePropertyNotSet Property
BuiltInFailures..::..MEPCalculationFailures Class See Also
---
The calculation could not be executed as configured. Specify a constraint property set for the following input or output node(s).
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId Network_NodePropertyNotSet { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Network_NodePropertyNotSet As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ Network_NodePropertyNotSet {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MEPCalculationFailures Class
Autodesk.Revit.DB Namespace